{
  "backend/main.mo": "Main backend actor implementing game logic with access control, player/wallet/game session management, bot configuration, multiple game modes (classic, quick, master, etc.), ranked/unranked status, and automatic user initialization with migration support.",
  "backend/migration.mo": "Migration module that transforms old actor state to new schema, adding RankedStatus field to GameSession and preserving the new #master GameMode variant while mapping old game data structures.",
  "feature_evidence.json": "Feature evidence report documenting implementation of game mode selector (Classic/Quick/Master), mode-specific board layouts, ranked/unranked variants, and mobile optimization across GameLobby.tsx and GameBoard.tsx components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including hooks with RankedStatus support, routing with gameMode parameters, mode-specific UI adaptations (shortened paths, timers, dice choice), and mobile-optimized styling.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div for React mounting, titled 'LudoVerse ICP – The Future Table Game'.",
  "frontend/src/App.tsx": "Main React application component managing authentication, user initialization, profile setup flow, view routing (dashboard/lobby/game/wallet/profile/about/guide), and game session state with mode-specific parameters.",
  "frontend/src/components/AboutPage.tsx": "Displays an informational page about LudoVerse ICP with game features, betting details, blockchain security info, and official wallet addresses with copy-to-clipboard functionality.",
  "frontend/src/components/ChatPanel.tsx": "Implements a real-time chat panel for in-game messaging with auto-scroll, simulated AI player messages, and message history display.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component showing user stats, wallet balance, game modes, and navigation options; displays welcome screen for unauthenticated users with feature highlights.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/GameBoard.tsx": "Renders a 3D Ludo game board using Three.js/React Three Fiber with animated pieces, dice rolling, player turns, and game state management for different game modes (classic/quick).",
  "frontend/src/components/GameLobby.tsx": "Game lobby interface for creating and joining games with mode selection (classic/quick/master), bet amount input, ranked/unranked toggle, and live/demo game options.",
  "frontend/src/components/Header.tsx": "Navigation header component with logo, view-based navigation buttons (Dashboard, Play, Wallet, Profile, Guide, About), and authentication controls using Internet Identity. Handles login/logout with toast notifications and query cache management.",
  "frontend/src/components/ProfilePage.tsx": "Player profile management page displaying user stats (games played, wins, losses, win rate) with editable name and color selection. Includes edit/save/cancel functionality with validation and toast notifications.",
  "frontend/src/components/ProfileSetup.tsx": "Initial profile creation form for new users with name input (2-20 characters) and color selection from predefined options. Handles profile creation with validation, error handling, and automatic refresh on duplicate profile detection.",
  "frontend/src/components/UserGuide.tsx": "Comprehensive onboarding guide explaining the complete flow: Internet Identity login, profile creation, ICP wallet deposits/withdrawals, and gameplay. Includes step-by-step instructions with icons, real blockchain integration notices, and clipboard copy functionality for wallet addresses.",
  "frontend/src/components/WalletManager.tsx": "Wallet management interface with tabs for deposit, withdrawal, and premium upgrade operations. Handles ICP transactions with amount validation, balance checks, principal ID display with copy functionality, and official wallet information display.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically recreates actor when identity changes and invalidates dependent queries to trigger refetches.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including user profile management, player creation/updates, wallet operations, game sessions, ranked status, bot configuration, and leaderboard queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with casino-themed OKLCH color palette (purple, gold, pink, cyan), Ludo player colors (red, green, yellow, blue), and custom utility classes for glow effects, neon borders, and holographic backgrounds.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with OKLCH color system for casino aesthetics, custom border radius, glow shadows, and responsive container settings.",
  "project_state.json": "Project metadata tracking LudoVerse development phases, architectural decisions (demo/live modes, AI agents, Unity WebGL rendering), known issues (deployment errors, non-functional demo mode, broken piece movement), and existing features."
}