{
  "backend/main.mo": "Main Motoko actor defining game types (GameMode, GameSession, Player, BotConfig, MatchmakingRoom), access control integration, and public functions for user profiles, wallets, game sessions, matchmaking rooms, and bot management with role-based authorization.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for automatic Internet Identity login: removing manual prompts in App.tsx, adding error handling in useInternetIdentity.ts, and updating Header.tsx to reflect auto-login state.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including React Query hooks for room/dice operations, authentication flow in App.tsx, Header/Footer/Dashboard components, GameLobby with matchmaking, 3D GameBoard with server-authoritative dice, ChatPanel, WalletManager, and styling configurations.",
  "frontend/index.html": "HTML entry point for the LudoVerse ICP React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component managing authentication state, automatic user initialization, view routing (dashboard/lobby/game/wallet/profile/about/guide), profile setup flow, loading states, and error handling with retry logic.",
  "frontend/src/components/AboutPage.tsx": "About page component displaying LudoVerse ICP description, feature cards (real ICP betting, live multiplayer, blockchain security), official wallet addresses with copy functionality, technology stack info, and getting started guide.",
  "frontend/src/components/ChatPanel.tsx": "Real-time chat component for in-game messaging with message history display, send functionality, simulated AI player messages on intervals, auto-scrolling, and color-coded player names using user profile data.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component displaying the LudoVerse ICP landing page with game features, user stats (win rate, balance, games played), and navigation to lobby/wallet/guide. Shows different content for authenticated vs unauthenticated users.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a pulsing heart icon.",
  "frontend/src/components/GameBoard.tsx": "3D game board component using React Three Fiber to render the Ludo board with pieces, dice, and game state. Handles game logic, dice rolling, piece movement, player turns, and real-time game state synchronization with optimistic updates and reconnection support.",
  "frontend/src/components/GameLobby.tsx": "Game lobby interface for creating/joining games with options for game modes (classic/quick/master), bet amounts, ranked/unranked play, live/demo games, and room management (public/private rooms). Displays available games, bots, and rooms with filtering and join functionality.",
  "frontend/src/components/Header.tsx": "Navigation header with logo, authentication controls (login/logout via Internet Identity), and navigation buttons for dashboard, play, wallet, profile, about, and guide sections. Displays user balance when authenticated.",
  "frontend/src/components/ProfilePage.tsx": "User profile page allowing players to view and edit their name and color preference, displaying game statistics including wins, losses, games played, win rate, and ranking with visual stat cards.",
  "frontend/src/components/ProfileSetup.tsx": "React component for creating a player profile with name input (2-20 chars) and color selection from predefined options. Handles profile creation via mutation with validation, error handling, and toast notifications.",
  "frontend/src/components/UserGuide.tsx": "Comprehensive user guide component explaining ICP blockchain integration, authentication with Internet Identity, wallet operations (deposit/withdraw), and gameplay mechanics. Displays step-by-step instructions with icons and alerts about real blockchain transactions.",
  "frontend/src/components/WalletManager.tsx": "Wallet management interface with tabs for viewing balance, depositing ICP (min 1, max 1M), withdrawing funds, and upgrading to premium membership (5 ICP cost). Includes clipboard copy functionality for principal ID and transaction validation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useGameStateSync.ts": "Hook for polling and synchronizing game state at configurable intervals (default 2s). Detects state changes, updates query cache, and triggers callbacks when game state updates are received from the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using DFINITY's AuthClient. Manages login status, identity lifecycle, and provides login/logout functionality with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useOptimisticState.ts": "Generic hook for managing optimistic UI updates with rollback capability. Tracks pending updates with IDs and timestamps, allows confirmation or rollback of updates, and provides both optimistic display state and confirmed state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user initialization, profile management, player CRUD operations, wallet queries, game sessions, matchmaking rooms, and bot configuration using TanStack Query and the ICP actor.",
  "frontend/src/hooks/useReconnect.ts": "Implements reconnection logic with exponential backoff for game sessions, monitoring online/offline status and automatically attempting to restore game state when connectivity is regained.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with casino-style OKLCH color palette, Ludo player colors (red/green/yellow/blue), glow shadow utilities, neon border effects, and holographic gradients for a premium gaming aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for TanStack Query and InternetIdentityProvider for ICP authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH colors for casino aesthetics, Ludo player colors, sidebar variants, custom border radius, box shadows with glow effects, and responsive container settings.",
  "project_state.json": "Project metadata documenting LudoVerse as a multiplayer Ludo game with demo/live modes, tracking completed phases (visual upgrades, game modes, multiplayer infrastructure), known issues (demo mode not working, AI agent broken, deployment errors), and planned features for ICP blockchain integration."
}